## Staging: ecs
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 27 to add, 0 to change, 27 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                                           NAME                                                           |
|----------|--------------------------------------------------------------------------------------------------------------------------|
| recreate | `aws_cloudwatch_log_group.ai_answers_group`                                                                              |
|          | `aws_cloudwatch_log_stream.ai_answers_stream`                                                                            |
|          | `aws_security_group.ecs_tasks`                                                                                           |
|          | `aws_security_group_rule.database_ingress_ecs`                                                                           |
|          | `aws_security_group_rule.ecs_egress_all`                                                                                 |
|          | `aws_security_group_rule.ecs_egress_database`                                                                            |
|          | `aws_security_group_rule.ecs_ingress_lb`                                                                                 |
|          | `module.ai_answers.aws_appautoscaling_policy.this[&quot;cpu&quot;]`                                                                |
|          | `module.ai_answers.aws_appautoscaling_policy.this[&quot;memory&quot;]`                                                             |
|          | `module.ai_answers.aws_appautoscaling_target.this[0]`                                                                    |
|          | `module.ai_answers.aws_cloudwatch_log_group.this`                                                                        |
|          | `module.ai_answers.aws_cloudwatch_log_subscription_filter.this_sentinel_forwarder[0]`                                    |
|          | `module.ai_answers.aws_ecs_cluster.this[0]`                                                                              |
|          | `module.ai_answers.aws_ecs_cluster_capacity_providers.this[0]`                                                           |
|          | `module.ai_answers.aws_ecs_service.this`                                                                                 |
|          | `module.ai_answers.aws_ecs_task_definition.this`                                                                         |
|          | `module.ai_answers.aws_iam_policy.this_task_exec`                                                                        |
|          | `module.ai_answers.aws_iam_role.this_task`                                                                               |
|          | `module.ai_answers.aws_iam_role.this_task_exec`                                                                          |
|          | `module.ai_answers.aws_iam_role_policy_attachment.this_task_exec`                                                        |
|          | `module.ai_answers.module.sentinel_forwarder[0].aws_cloudwatch_log_group.sentinel_forwarder_lambda`                      |
|          | `module.ai_answers.module.sentinel_forwarder[0].aws_iam_policy.sentinel_forwarder_lambda`                                |
|          | `module.ai_answers.module.sentinel_forwarder[0].aws_iam_role.sentinel_forwarder_lambda`                                  |
|          | `module.ai_answers.module.sentinel_forwarder[0].aws_iam_role_policy_attachment.sentinel_forwarder_lambda`                |
|          | `module.ai_answers.module.sentinel_forwarder[0].aws_lambda_function.sentinel_forwarder`                                  |
|          | `module.ai_answers.module.sentinel_forwarder[0].aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0]` |
|          | `module.ai_answers.module.sentinel_forwarder[0].aws_ssm_parameter.sentinel_forwarder_auth`                               |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/ai-answers/actions/runs/14067387408).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.ai_answers_group must be replaced
-/+ resource "aws_cloudwatch_log_group" "ai_answers_group" {
      ~ arn               = "arn:aws:logs:ca-central-1:992382783569:log-group:/aws/ecs/ai-answers-cluster" -> (known after apply)
      ~ id                = "/aws/ecs/ai-answers-cluster" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/ecs/ai-answers-cluster" -> "/aws/ecs/ai-answers-staging-cluster" # forces replacement
      + name_prefix       = (known after apply)
      - tags              = {} -> null
        # (4 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_stream.ai_answers_stream must be replaced
-/+ resource "aws_cloudwatch_log_stream" "ai_answers_stream" {
      ~ arn            = "arn:aws:logs:ca-central-1:992382783569:log-group:/aws/ecs/ai-answers-cluster:log-stream:ai-answers-log-stream" -> (known after apply)
      ~ id             = "ai-answers-log-stream" -> (known after apply)
      ~ log_group_name = "/aws/ecs/ai-answers-cluster" -> "/aws/ecs/ai-answers-staging-cluster" # forces replacement
      ~ name           = "ai-answers-log-stream" -> "ai-answers-staging-log-stream" # forces replacement
    }

  # aws_security_group.ecs_tasks must be replaced
-/+ resource "aws_security_group" "ecs_tasks" {
      ~ arn                    = "arn:aws:ec2:ca-central-1:992382783569:security-group/sg-085c606383f33733e" -> (known after apply)
      ~ description            = "Allow inbound and outbound traffic for AI Answers" -> "Allow inbound and outbound traffic for ai-answers staging" # forces replacement
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow ECS security group to send all traffic"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          - {
              - cidr_blocks      = []
              - description      = "Allow ECS to talk to the DocumentDB cluster"
              - from_port        = 27017
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-04966047bf236b850",
                ]
              - self             = false
              - to_port          = 27017
            },
        ]
      ~ id                     = "sg-085c606383f33733e" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Allow the ecs security group to receive traffic only from the load balancer on port 3001"
              - from_port        = 3001
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-08e35f1019824d56a",
                ]
              - self             = false
              - to_port          = 3001
            },
        ]
      ~ name                   = "ai-answers-security-group" -> "ai-answers-staging-security-group" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "992382783569" -> (known after apply)
        tags                   = {
            "CostCentre" = "ai-answers-staging"
        }
        # (3 unchanged attributes hidden)
    }

  # aws_security_group_rule.database_ingress_ecs must be replaced
-/+ resource "aws_security_group_rule" "database_ingress_ecs" {
      ~ id                       = "sgrule-457767303" -> (known after apply)
      ~ security_group_rule_id   = "sgr-08374bce352b5f3ad" -> (known after apply)
      ~ source_security_group_id = "sg-085c606383f33733e" -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # aws_security_group_rule.ecs_egress_all must be replaced
-/+ resource "aws_security_group_rule" "ecs_egress_all" {
      ~ id                       = "sgrule-3679506382" -> (known after apply)
      ~ security_group_id        = "sg-085c606383f33733e" -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0f412e1fd0d771752" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_security_group_rule.ecs_egress_database must be replaced
-/+ resource "aws_security_group_rule" "ecs_egress_database" {
      ~ id                       = "sgrule-881858147" -> (known after apply)
      ~ security_group_id        = "sg-085c606383f33733e" -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-016682d500ff42e0b" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_security_group_rule.ecs_ingress_lb must be replaced
-/+ resource "aws_security_group_rule" "ecs_ingress_lb" {
      ~ id                       = "sgrule-2118413993" -> (known after apply)
      ~ security_group_id        = "sg-085c606383f33733e" -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0947259996e0a3a63" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.ai_answers.data.aws_ecs_task_definition.this_latest will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this_latest" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = (known after apply)
      + enable_fault_injection   = (known after apply)
      + ephemeral_storage        = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = (known after apply)
      + id                       = (known after apply)
      + inference_accelerator    = (known after apply)
      + ipc_mode                 = (known after apply)
      + memory                   = (known after apply)
      + network_mode             = (known after apply)
      + pid_mode                 = (known after apply)
      + placement_constraints    = (known after apply)
      + proxy_configuration      = (known after apply)
      + requires_compatibilities = (known after apply)
      + revision                 = (known after apply)
      + runtime_platform         = (known after apply)
      + status                   = (known after apply)
      + task_definition          = "ai-answers-staging-task"
      + task_role_arn            = (known after apply)
      + volume                   = (known after apply)
    }

  # module.ai_answers.data.aws_iam_policy_document.this_task_exec_combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ecr:GetDownloadUrlForLayer",
                              + "ecr:GetAuthorizationToken",
                              + "ecr:BatchGetImage",
                              + "ecr:BatchCheckLayerAvailability",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + (known after apply),
        ]
    }

  # module.ai_answers.data.aws_iam_policy_document.this_task_exec_logs will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:DescribeLogGroups",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.ai_answers.aws_appautoscaling_policy.this["cpu"] must be replaced
-/+ resource "aws_appautoscaling_policy" "this" {
      ~ alarm_arns         = [
          - "arn:aws:cloudwatch:ca-central-1:992382783569:alarm:TargetTracking-service/ai-answers-cluster/ai-answers-app-service-AlarmHigh-6f658f7b-29b6-4b65-b6ee-efd64644b41e",
          - "arn:aws:cloudwatch:ca-central-1:992382783569:alarm:TargetTracking-service/ai-answers-cluster/ai-answers-app-service-AlarmLow-20c8c0c0-0093-4b8d-adeb-be3443576118",
        ] -> (known after apply)
      ~ arn                = "arn:aws:autoscaling:ca-central-1:992382783569:scalingPolicy:527516b2-ede0-4ab6-85c6-70438f6b44c8:resource/ecs/service/ai-answers-cluster/ai-answers-app-service:policyName/cpu" -> (known after apply)
      ~ id                 = "cpu" -> (known after apply)
        name               = "cpu"
      ~ resource_id        = "service/ai-answers-cluster/ai-answers-app-service" -> "service/ai-answers-staging-cluster/ai-answers-staging-app-service" # forces replacement
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ai_answers.aws_appautoscaling_policy.this["memory"] must be replaced
-/+ resource "aws_appautoscaling_policy" "this" {
      ~ alarm_arns         = [
          - "arn:aws:cloudwatch:ca-central-1:992382783569:alarm:TargetTracking-service/ai-answers-cluster/ai-answers-app-service-AlarmHigh-f0b6b411-6352-4348-a795-3d2bac0da444",
          - "arn:aws:cloudwatch:ca-central-1:992382783569:alarm:TargetTracking-service/ai-answers-cluster/ai-answers-app-service-AlarmLow-d8197e09-ed23-4f16-85a2-02d8cee5d7f0",
        ] -> (known after apply)
      ~ arn                = "arn:aws:autoscaling:ca-central-1:992382783569:scalingPolicy:527516b2-ede0-4ab6-85c6-70438f6b44c8:resource/ecs/service/ai-answers-cluster/ai-answers-app-service:policyName/memory" -> (known after apply)
      ~ id                 = "memory" -> (known after apply)
        name               = "memory"
      ~ resource_id        = "service/ai-answers-cluster/ai-answers-app-service" -> "service/ai-answers-staging-cluster/ai-answers-staging-app-service" # forces replacement
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ai_answers.aws_appautoscaling_target.this[0] must be replaced
-/+ resource "aws_appautoscaling_target" "this" {
      ~ arn                = "arn:aws:application-autoscaling:ca-central-1:992382783569:scalable-target/0ec5527516b2ede04ab685c670438f6b44c8" -> (known after apply)
      ~ id                 = "service/ai-answers-cluster/ai-answers-app-service" -> (known after apply)
      ~ resource_id        = "service/ai-answers-cluster/ai-answers-app-service" -> "service/ai-answers-staging-cluster/ai-answers-staging-app-service" # forces replacement
      ~ role_arn           = "arn:aws:iam::992382783569:role/aws-service-role/ecs.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_ECSService" -> (known after apply)
        tags               = {
            "CostCentre" = "ai-answers-staging"
            "Terraform"  = "true"
        }
        # (5 unchanged attributes hidden)

      ~ suspended_state (known after apply)
      - suspended_state {
          - dynamic_scaling_in_suspended  = false -> null
          - dynamic_scaling_out_suspended = false -> null
          - scheduled_scaling_suspended   = false -> null
        }
    }

  # module.ai_answers.aws_cloudwatch_log_group.this must be replaced
-/+ resource "aws_cloudwatch_log_group" "this" {
      ~ arn               = "arn:aws:logs:ca-central-1:992382783569:log-group:/aws/ecs/ai-answers-cluster/ai-answers-app-service" -> (known after apply)
      ~ id                = "/aws/ecs/ai-answers-cluster/ai-answers-app-service" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/ecs/ai-answers-cluster/ai-answers-app-service" -> "/aws/ecs/ai-answers-staging-cluster/ai-answers-staging-app-service" # forces replacement
      + name_prefix       = (known after apply)
        tags              = {
            "CostCentre" = "ai-answers-staging"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # module.ai_answers.aws_cloudwatch_log_subscription_filter.this_sentinel_forwarder[0] must be replaced
-/+ resource "aws_cloudwatch_log_subscription_filter" "this_sentinel_forwarder" {
      ~ destination_arn = "arn:aws:lambda:ca-central-1:992382783569:function:ai-answers-cluster" -> (known after apply) # forces replacement
      ~ id              = "cwlsf-4244148207" -> (known after apply)
      ~ log_group_name  = "/aws/ecs/ai-answers-cluster/ai-answers-app-service" -> "/aws/ecs/ai-answers-staging-cluster/ai-answers-staging-app-service" # forces replacement
        name            = "All cluster logs"
      + role_arn        = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.ai_answers.aws_ecs_cluster.this[0] must be replaced
-/+ resource "aws_ecs_cluster" "this" {
      ~ arn      = "arn:aws:ecs:ca-central-1:992382783569:cluster/ai-answers-cluster" -> (known after apply)
      ~ id       = "arn:aws:ecs:ca-central-1:992382783569:cluster/ai-answers-cluster" -> (known after apply)
      ~ name     = "ai-answers-cluster" -> "ai-answers-staging-cluster" # forces replacement
        tags     = {
            "CostCentre" = "ai-answers-staging"
            "Terraform"  = "true"
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.ai_answers.aws_ecs_cluster_capacity_providers.this[0] must be replaced
-/+ resource "aws_ecs_cluster_capacity_providers" "this" {
      ~ cluster_name       = "ai-answers-cluster" -> "ai-answers-staging-cluster" # forces replacement
      ~ id                 = "ai-answers-cluster" -> (known after apply)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.ai_answers.aws_ecs_service.this must be replaced
-/+ resource "aws_ecs_service" "this" {
      ~ cluster                            = "ai-answers-cluster" -> "ai-answers-staging-cluster" # forces replacement
      ~ iam_role                           = "/aws-service-role/ecs.amazonaws.com/AWSServiceRoleForECS" -> (known after apply)
      ~ id                                 = "arn:aws:ecs:ca-central-1:992382783569:service/ai-answers-cluster/ai-answers-app-service" -> (known after apply)
      ~ name                               = "ai-answers-app-service" -> "ai-answers-staging-app-service" # forces replacement
        tags                               = {
            "CostCentre" = "ai-answers-staging"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:992382783569:task-definition/ai-answers-task:17" -> (known after apply)
      ~ triggers                           = {} -> (known after apply)
        # (13 unchanged attributes hidden)

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }

      - load_balancer {
          - container_name   = "ai-answers" -> null
          - container_port   = 3001 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:992382783569:targetgroup/ai-answers/2ad377cc9d36fc44" -> null
            # (1 unchanged attribute hidden)
        }
      + load_balancer {
          + container_name   = "ai-answers-staging"
          + container_port   = 3001
          + target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:992382783569:targetgroup/ai-answers/2ad377cc9d36fc44"
            # (1 unchanged attribute hidden)
        }

      ~ network_configuration {
          ~ security_groups  = [
              - "sg-085c606383f33733e",
            ] -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.ai_answers.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:992382783569:task-definition/ai-answers-task:17" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:992382783569:task-definition/ai-answers-task" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - environment            = []
                  ~ logConfiguration       = {
                      ~ options   = {
                          ~ awslogs-group         = "/aws/ecs/ai-answers-cluster/ai-answers-app-service" -> "/aws/ecs/ai-answers-staging-cluster/ai-answers-staging-app-service"
                            # (2 unchanged attributes hidden)
                        }
                        # (1 unchanged attribute hidden)
                    }
                  ~ name                   = "ai-answers" -> "ai-answers-staging"
                    # (9 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ family                   = "ai-answers-task" -> "ai-answers-staging-task" # forces replacement
      ~ id                       = "ai-answers-task" -> (known after apply)
      ~ revision                 = 17 -> (known after apply)
        tags                     = {
            "CostCentre" = "ai-answers-staging"
            "Terraform"  = "true"
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ai_answers.aws_iam_policy.this_task_exec must be replaced
-/+ resource "aws_iam_policy" "this_task_exec" {
      ~ arn              = "arn:aws:iam::992382783569:policy/ai-answers-task_ecs_task_exec_policy" -> (known after apply)
      ~ attachment_count = 1 -> (known after apply)
      ~ id               = "arn:aws:iam::992382783569:policy/ai-answers-task_ecs_task_exec_policy" -> (known after apply)
      ~ name             = "ai-answers-task_ecs_task_exec_policy" -> "ai-answers-staging-task_ecs_task_exec_policy" # forces replacement
      + name_prefix      = (known after apply)
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "logs:DescribeLogGroups"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:992382783569:log-group:/aws/ecs/ai-answers-cluster/ai-answers-app-service:*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ policy_id        = "ANPA6ODU7SBITKZ7XPODT" -> (known after apply)
        tags             = {
            "CostCentre" = "ai-answers-staging"
            "Terraform"  = "true"
        }
        # (3 unchanged attributes hidden)
    }

  # module.ai_answers.aws_iam_role.this_task must be replaced
-/+ resource "aws_iam_role" "this_task" {
      ~ arn                   = "arn:aws:iam::992382783569:role/ai-answers-task_ecs_task_role" -> (known after apply)
      ~ create_date           = "2025-02-11T20:07:30Z" -> (known after apply)
      ~ id                    = "ai-answers-task_ecs_task_role" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "ai-answers-task_ecs_task_role" -> "ai-answers-staging-task_ecs_task_role" # forces replacement
      + name_prefix           = (known after apply)
        tags                  = {
            "CostCentre" = "ai-answers-staging"
            "Terraform"  = "true"
        }
      ~ unique_id             = "AROA6ODU7SBI4OL3OOJIR" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ inline_policy (known after apply)
    }

  # module.ai_answers.aws_iam_role.this_task_exec must be replaced
-/+ resource "aws_iam_role" "this_task_exec" {
      ~ arn                   = "arn:aws:iam::992382783569:role/ai-answers-task_ecs_task_exec_role" -> (known after apply)
      ~ create_date           = "2025-02-11T20:07:30Z" -> (known after apply)
      ~ id                    = "ai-answers-task_ecs_task_exec_role" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::992382783569:policy/ai-answers-task_ecs_task_exec_policy",
        ] -> (known after apply)
      ~ name                  = "ai-answers-task_ecs_task_exec_role" -> "ai-answers-staging-task_ecs_task_exec_role" # forces replacement
      + name_prefix           = (known after apply)
        tags                  = {
            "CostCentre" = "ai-answers-staging"
            "Terraform"  = "true"
        }
      ~ unique_id             = "AROA6ODU7SBI263NHQ235" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ inline_policy (known after apply)
    }

  # module.ai_answers.aws_iam_role_policy_attachment.this_task_exec must be replaced
-/+ resource "aws_iam_role_policy_attachment" "this_task_exec" {
      ~ id         = "ai-answers-task_ecs_task_exec_role-20250211200730853600000001" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::992382783569:policy/ai-answers-task_ecs_task_exec_policy" -> (known after apply) # forces replacement
      ~ role       = "ai-answers-task_ecs_task_exec_role" -> "ai-answers-staging-task_ecs_task_exec_role" # forces replacement
    }

  # module.ai_answers.module.sentinel_forwarder[0].data.aws_iam_policy_document.sentinel_forwarder_lambda will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sentinel_forwarder_lambda" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "xray:GetSamplingRules",
              + "xray:GetSamplingStatisticSummaries",
              + "xray:GetSamplingTargets",
              + "xray:PutTelemetryRecords",
              + "xray:PutTraceSegments",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter",
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.ai_answers.module.sentinel_forwarder[0].aws_cloudwatch_log_group.sentinel_forwarder_lambda must be replaced
-/+ resource "aws_cloudwatch_log_group" "sentinel_forwarder_lambda" {
      ~ arn               = "arn:aws:logs:ca-central-1:992382783569:log-group:/aws/lambda/ai-answers-cluster" -> (known after apply)
      ~ id                = "/aws/lambda/ai-answers-cluster" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/lambda/ai-answers-cluster" -> "/aws/lambda/ai-answers-staging-cluster" # forces replacement
      + name_prefix       = (known after apply)
        tags              = {
            "CostCentre" = "ai-answers-staging"
        }
        # (4 unchanged attributes hidden)
    }

  # module.ai_answers.module.sentinel_forwarder[0].aws_iam_policy.sentinel_forwarder_lambda must be replaced
-/+ resource "aws_iam_policy" "sentinel_forwarder_lambda" {
      ~ arn              = "arn:aws:iam::992382783569:policy/SentinelForwarderLambda-ai-answers-cluster" -> (known after apply)
      ~ attachment_count = 1 -> (known after apply)
      ~ id               = "arn:aws:iam::992382783569:policy/SentinelForwarderLambda-ai-answers-cluster" -> (known after apply)
      ~ name             = "SentinelForwarderLambda-ai-answers-cluster" -> "SentinelForwarderLambda-ai-answers-staging-cluster" # forces replacement
      + name_prefix      = (known after apply)
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:992382783569:log-group:/aws/lambda/ai-answers-cluster:*"
                    },
                  - {
                      - Action   = [
                          - "xray:PutTraceSegments",
                          - "xray:PutTelemetryRecords",
                          - "xray:GetSamplingTargets",
                          - "xray:GetSamplingStatisticSummaries",
                          - "xray:GetSamplingRules",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:GetParameter",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:ca-central-1:992382783569:parameter/ai-answers-cluster-auth"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ policy_id        = "ANPA6ODU7SBI7AMO7HRSR" -> (known after apply)
      - tags             = {} -> null
        # (3 unchanged attributes hidden)
    }

  # module.ai_answers.module.sentinel_forwarder[0].aws_iam_role.sentinel_forwarder_lambda must be replaced
-/+ resource "aws_iam_role" "sentinel_forwarder_lambda" {
      ~ arn                   = "arn:aws:iam::992382783569:role/SentinelForwarderLambda-ai-answers-cluster" -> (known after apply)
      ~ create_date           = "2025-02-11T20:07:30Z" -> (known after apply)
      ~ id                    = "SentinelForwarderLambda-ai-answers-cluster" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::992382783569:policy/SentinelForwarderLambda-ai-answers-cluster",
        ] -> (known after apply)
      ~ name                  = "SentinelForwarderLambda-ai-answers-cluster" -> "SentinelForwarderLambda-ai-answers-staging-cluster" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ unique_id             = "AROA6ODU7SBIWXXMK7FTH" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ inline_policy (known after apply)
    }

  # module.ai_answers.module.sentinel_forwarder[0].aws_iam_role_policy_attachment.sentinel_forwarder_lambda must be replaced
-/+ resource "aws_iam_role_policy_attachment" "sentinel_forwarder_lambda" {
      ~ id         = "SentinelForwarderLambda-ai-answers-cluster-20250211200730948600000002" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::992382783569:policy/SentinelForwarderLambda-ai-answers-cluster" -> (known after apply) # forces replacement
      ~ role       = "SentinelForwarderLambda-ai-answers-cluster" -> "SentinelForwarderLambda-ai-answers-staging-cluster" # forces replacement
    }

  # module.ai_answers.module.sentinel_forwarder[0].aws_lambda_function.sentinel_forwarder must be replaced
-/+ resource "aws_lambda_function" "sentinel_forwarder" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:ca-central-1:992382783569:function:ai-answers-cluster" -> (known after apply)
      ~ code_sha256                    = "mfdZfYUgPWLo+yh9aU8f33p2Tg+J0YOaJr3kKgPNVhE=" -> (known after apply)
      ~ function_name                  = "ai-answers-cluster" -> "ai-answers-staging-cluster" # forces replacement
      ~ id                             = "ai-answers-cluster" -> (known after apply)
      ~ invoke_arn                     =...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.ai_answers_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.ecs_tasks"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_cloudwatch_log_group.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_iam_policy.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_iam_role.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_lambda_function.sentinel_forwarder"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_ssm_parameter.sentinel_forwarder_auth"]

26 tests, 19 passed, 7 warnings, 0 failures, 0 exceptions

```

</details>
